backend/controllers/BackToOfficeReportController.php

    public function actionBtorReports() {
        if (User::userIsAllowedTo('Review back to office report') ||
                User::userIsAllowedTo("View back to office report")) {
            $searchModel = new MeBackToOfficeReportSearch();
            $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
            $dataProvider->pagination = ['pageSize' => 15];
            $dataProvider->setSort([
                'attributes' => [
                    'created_at' => [
                        'desc' => ['created_at' => SORT_DESC],
                        'default' => SORT_DESC
                    ],
                ],
                'defaultOrder' => [
                    'created_at' => SORT_DESC
                ]
            ]);
            if (User::userIsAllowedTo("View back to office report")) {
                //We pull BtORs for only a single province
                //We get ids of users that belong to a logged in users province
                $_users_model = User::find()->select(['id'])->where(['province_id' => Yii::$app->user->identity->province_id])->all();
---
SELECT `id` FROM `users` WHERE `province_id`=0