backend/controllers/RoleController.php

SELECT * FROM `roles` WHERE `id`='11'
---
    protected function findModel($id) {
        if (($model = Role::findOne($id)) !== null) {