backend/controllers/SiteController.php

    public function actionLogin() {
        //$session = Yii::$app->session;
        //$session->destroy();
        $this->layout = 'main_1';
        if (!Yii::$app->user->isGuest) {
            return $this->goHome();
        }

        $model = new LoginForm();
        if ($model->load(Yii::$app->request->post()) && $model->login()) {
            $user = User::findOne(['id' => Yii::$app->user->id]);
            $rightsArray = \common\models\RightAllocation::getRights(Yii::$app->getUser()->identity->role);
            $rights = \implode(",", $rightsArray);
            $session = Yii::$app->session;
            $session->set('role', Role::findOne(['id' => Yii::$app->getUser()->identity->role])->role);
---
SELECT * FROM `users` WHERE `id`=18
SELECT * FROM `roles` WHERE `id`=11