backend/controllers/StoryofchangeController.php

    public function actionStories() {
        if (User::userIsAllowedTo('Review Story of change') ||
                User::userIsAllowedTo("View Story of change")) {
            $searchModel = new StoryofchangeSearch();
            $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
            if (User::userIsAllowedTo("View Story of change")) {
                //We pull stories for only a single province
                $_users_model = User::find()->select(['id'])->where(['province_id' => Yii::$app->user->identity->province_id])->all();
---
SELECT `id` FROM `users` WHERE `province_id`=0