backend/views/home/home.php

SELECT `id`, `name`, ST_AsGeoJSON(polygon) AS `polygon` FROM `province`
---
$this->params['breadcrumbs'][] = $this->title;


$provinces_model = \backend\models\Provinces::find()
        ->cache(Yii::$app->params['cache_duration'])
        ->select(['id', 'name', 'ST_AsGeoJSON(polygon) as polygon'])
        ->all();

SELECT COUNT(*) FROM `camp` WHERE `district_id`=119
SELECT COUNT(*) FROM (SELECT DISTINCT `market_id` FROM `commodity_price_collection` WHERE `created_by`=19) `c`
SELECT COUNT(*) FROM `commodity_price_collection` WHERE (`created_by`=19) AND (`year`='2021')
SELECT COUNT(*) FROM (SELECT DISTINCT `commodity_type_id` FROM `commodity_price_collection` WHERE (`created_by`=19) AND (`year`='2021')) `c`
---
if (User::userIsAllowedTo("View commodity prices") || User::userIsAllowedTo('Collect commodity prices')) {
    echo '<h6 class="mt-2 mb-1"> Commodity price statistics</h6>';
    if (Yii::$app->getUser()->identity->district_id > 0) {
        $Camps = backend\models\Camps::find()->where(['district_id' => Yii::$app->getUser()->identity->district_id])->count();
        $markets = \backend\models\CommodityPriceCollection::find()
                ->select(["market_id"])
                ->where(["created_by" => Yii::$app->getUser()->identity->id])
                ->distinct()
                ->count();
        $collected_commodity_prices = backend\models\CommodityPriceCollection::find()
                ->where(["created_by" => Yii::$app->getUser()->identity->id])
                ->andWhere(["year" => date("Y")])
                ->count();
        $collected_commodity_types = backend\models\CommodityPriceCollection::find()
                ->select(["commodity_type_id"])
                ->where(["created_by" => Yii::$app->getUser()->identity->id])
                ->andWhere(["year" => date("Y")])
                ->distinct()
                ->count();

SELECT COUNT(*) FROM `me_faabs_groups`
SELECT COUNT(*) FROM `district`
SELECT COUNT(*) FROM `camp`
SELECT COUNT(*) FROM `market`
---
        </div>
        <?php
    } else {
        $provinces = backend\models\MeFaabsGroups::find()->count();
        $Districts = backend\models\Districts::find()->count();
        $Camps = backend\models\Camps::find()->count();
        $markets = \backend\models\Markets::find()->count();

SELECT * FROM `awpb_template` WHERE `status`=1
---
                <ul class="todo-list" data-widget="todo-list">
                    <li>
                        <?php
                        $awpb_template = \backend\models\AwpbTemplate::findOne([
<<<<<<< HEAD
                                    'status' => \backend\models\AwpbTemplate::STATUS_ACTIVE,
=======
                                    'status' => \backend\models\AwpbTemplate::STATUS_PUBLISHED,
>>>>>>> 87e1ba7543e0dfcf71922c993956787e66ff639d
                        ]);

SELECT * FROM `camp` WHERE `district_id`=119
---
            <div class="tab-pane fade show active" id="custom-tabs-three-home" role="tabpanel" aria-labelledby="custom-tabs-three-home-tab">
                <?php
                if (!empty(Yii::$app->user->identity->district_id)) {
                    $dataProviderCamps = \backend\models\Camps::find()
                            ->cache(Yii::$app->params['cache_duration'])
                            ->where(['district_id' => Yii::$app->user->identity->district_id])
                            ->all();