backend/views/districts/index.php

SELECT * FROM `province` WHERE `id`=11
---
                    'data' => \backend\models\Provinces::getProvinceList(),
                ],
                'value' => function ($model) {
                    $name = backend\models\Provinces::findOne($model->province_id)->name;