backend/views/layouts/main.php

SELECT * FROM `users` WHERE `id` IS NULL
---

                            <!-------------------------------AWPB MANAGEMENT STARTS----------------------->
                            <?php
                            $user = User::findOne(['id' => Yii::$app->user->id]);

SELECT * FROM `roles` WHERE `id`=11
---

                                    if (User::userIsAllowedTo("Manage AWPB") || User::userIsAllowedTo("Approve AWPB - Provincial") || User::userIsAllowedTo('Approve AWPB - PCO') || User::userIsAllowedTo('Approve AWPB - Ministry')) {
                                        echo '   <li class="nav-item">';
                                        $role = \common\models\Role::findOne(['id' => $user->role])->role;

SELECT * FROM `roles` WHERE `id`=11
---

                                     if (User::userIsAllowedTo('Manage PW AWPB') || User::userIsAllowedTo('Approve AWPB - PCO') || User::userIsAllowedTo('Approve AWPB - Ministry')) {
                                        echo '   <li class="nav-item">';
                                        $role = \common\models\Role::findOne(['id' => $user->role])->role;