backend/views/faabs-category-a-farmers/index.php


$this->title = 'Category \'A\' Farmers';
$this->params['breadcrumbs'][] = $this->title;
$district_model = \backend\models\Districts::findOne(Yii::$app->user->identity->district_id);
$district = !empty($district_model) ? $district_model->name : "";

$_camp_ids = [];
$camp_ids = \backend\models\Camps::find()
        ->select(['id'])
        ->where(['district_id' => Yii::$app->user->identity->district_id])
        ->asArray()
        ->all();
---
SELECT * FROM `district` WHERE `id`=0
SELECT `id` FROM `camp` WHERE `district_id`=0

                'filter' => \backend\models\Provinces::getProvinceList(),
                'filterInputOptions' => ['prompt' => 'Filter by Province', 'class' => 'form-control', 'id' => null],
                'value' => function ($model) {
                    $camp_id = \backend\models\MeFaabsGroups::findOne($model->faabs_group_id)->camp_id;
                    $district_id = \backend\models\Camps::findOne($camp_id)->district_id;
                    $province_id = backend\models\Districts::findOne($district_id)->province_id;
                    $name = backend\models\Provinces::findOne($province_id)->name;
---
SELECT * FROM `me_faabs_groups` WHERE `id`=5
SELECT * FROM `camp` WHERE `id`=10
SELECT * FROM `district` WHERE `id`=119
SELECT * FROM `province` WHERE `id`=11

                'filter' => \backend\models\Districts::getList(),
                'filterInputOptions' => ['prompt' => 'Filter by District', 'class' => 'form-control', 'id' => null],
                'value' => function ($model) {
                    $camp_id = \backend\models\MeFaabsGroups::findOne($model->faabs_group_id)->camp_id;
                    $district_id = \backend\models\Camps::findOne($camp_id)->district_id;
                    $name = backend\models\Districts::findOne($district_id)->name;
---
SELECT * FROM `me_faabs_groups` WHERE `id`=5
SELECT * FROM `camp` WHERE `id`=10
SELECT * FROM `district` WHERE `id`=119

                'filterInputOptions' => ['prompt' => 'Filter by camp', 'class' => 'form-control', 'id' => null],
                'value' => function ($model) {
                    $camp_id = \backend\models\MeFaabsGroups::findOne($model->faabs_group_id)->camp_id;
                    $name = backend\models\Camps::findOne($camp_id)->name;
---
SELECT * FROM `camp` WHERE `id`=10
SELECT * FROM `me_faabs_groups` WHERE `id`=5

                    return $name;
                }
            ],
            [
                'enableSorting' => true,
                'attribute' => 'faabs_group_id',
                'filterType' => \kartik\grid\GridView::FILTER_SELECT2,
                'filterWidgetOptions' => [
                    'pluginOptions' => ['allowClear' => true],
                ],
                'filter' => \backend\models\MeFaabsGroups::getList(),
                'filterInputOptions' => ['prompt' => 'Filter by FaaBS group', 'class' => 'form-control',],
                'format' => 'raw',
                'value' => function ($model) {
                    $name = backend\models\MeFaabsGroups::findOne($model->faabs_group_id)->name;
                    return $name;
                },
            ],
---
SELECT * FROM `me_faabs_groups` WHERE `id`=5