backend/models/AwpbTemplate.php

    public static function getId() {
        //$template = self::find()->where(['<>','status',AwpbTemplate::STATUS_OLD_BUDGET])->one();
        $template = self::find()->where(['status'=>self::STATUS_PUBLISHED])->one();
---
SELECT * FROM `awpb_template` WHERE `status`=1