backend/models/Camps.php

    public static function getList() {
        $list = self::find()->orderBy(['name' => SORT_ASC])->all();
        return ArrayHelper::map($list, 'id', 'name');
---
SELECT * FROM `camp` ORDER BY `name`

    public static function getListByDistrictId($id) {
        $list = self::find()->where(['district_id' => $id])->orderBy(['name' => SORT_ASC])->all();
        return ArrayHelper::map($list, 'id', 'name');
---
SELECT * FROM `camp` WHERE `district_id`=0 ORDER BY `name`