backend/models/Districts.php

    public static function getNames() {
        $names = self::find()->orderBy(['name' => SORT_ASC])->all();
---
SELECT * FROM `district` ORDER BY `name`

    public static function getList() {
        $list = self::find()->orderBy(['name' => SORT_ASC])->all();
---
SELECT * FROM `district` ORDER BY `name`