backend/models/LkmStoryofchangeCategory.php

SELECT * FROM `lkm_storyofchange_category` ORDER BY `name`
---
    public static function getList() {
        $list = self::find()->orderBy(['name' => SORT_ASC])->all();