backend/models/MeFaabsTrainingTopics.php

    public static function getList() {
        $query = static::find()
                ->select(["CONCAT(category,' - ',topic) as topic", 'id'])
                ->orderBy(['id' => SORT_ASC])
                ->asArray()
                ->all();

        return \yii\helpers\ArrayHelper::map($query, 'id', 'topic');
---
SELECT CONCAT(category,' - ',topic) AS `topic`, `id` FROM `me_faabs_training_topics` ORDER BY `id`