backend/models/MeFaabsCategoryAFarmers.php

SELECT CONCAT(CONCAT(CONCAT(title,' ',first_name),' ',other_names),' ',last_name) AS `name`, `first_name` FROM `me_faabs_category_a_farmers` ORDER BY `id`
---
    public static function getFullNames() {
        $query = static::find()
                ->select(["CONCAT(CONCAT(CONCAT(title,' ',first_name),' ',other_names),' ',last_name) as name", 'first_name'])
                //->where(["IN", 'status', [self::STATUS_ACTIVE]])
                ->orderBy(['id' => SORT_ASC])
                ->asArray()
                ->all();

        return \yii\helpers\ArrayHelper::map($query, 'first_name', 'name');