backend/models/MeFaabsGroups.php

SELECT * FROM `me_faabs_groups` WHERE `status`=1 ORDER BY `name`
---
    public static function getList() {
        $list = self::find()->Where(['status' => 1])->orderBy(['name' => SORT_ASC])->all();