backend/models/Provinces.php

SELECT * FROM `province` ORDER BY `name`
---
    public static function getProvinceList() {
        $provinces = self::find()->orderBy(['name' => SORT_ASC])->all();

SELECT * FROM `province` ORDER BY `name`
---
    public static function getProvinceNames() {
        $provinces = self::find()->orderBy(['name' => SORT_ASC])->all();