backend/models/User.php

    public static function findIdentity($id) {
        // return static::find()->cache(3600)->where(['id' => $id, 'status' => self::STATUS_ACTIVE])->one();
        return static::find()->where(['id' => $id, 'status' => self::STATUS_ACTIVE])->one();
---
SELECT * FROM `users` WHERE (`id`=18) AND (`status`=1)

    public static function findByUsername($username) {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `users` WHERE (`username`='admin@emis.com') AND (`status`=1)

    public static function getFullNames() {
        $query = static::find()
                ->select(["CONCAT(CONCAT(CONCAT(title,' ',first_name),' ',other_name),' ',last_name) as name", 'first_name'])
                //->where(["IN", 'status', [self::STATUS_ACTIVE]])
                ->orderBy(['id' => SORT_ASC])
                ->asArray()
                ->all();

        return \yii\helpers\ArrayHelper::map($query, 'first_name', 'name');
---
SELECT CONCAT(CONCAT(CONCAT(title,' ',first_name),' ',other_name),' ',last_name) AS `name`, `first_name` FROM `users` ORDER BY `id`